Revit 2027 API
ParameterTypeId.FabricationMaterialGauge Property
 "Material Gauge"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FabricationMaterialGauge { get; }
Public Shared ReadOnly Property FabricationMaterialGauge As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FabricationMaterialGauge {
	ForgeTypeId^ get ();
}
static member FabricationMaterialGauge : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace